In [5]:
#imported libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#stored the path of the data set 
data = pd.read_csv("C:/Users/MMANTC-MC-03/Desktop/Practical 2/Academic_Performance.csv")

In [3]:
#This function gives us the starting data from the dataset
data.head()

   Roll No     Name  Gender   Age  Percentage  Att. Percentage      Branch
0        1     John    Male  25.0        44.0               54    Computer
1        2    Emily  Female  17.0        88.0               55  Mechanical
2        3    David    Male  21.0        54.0               95       Civil
3        4      NaN  Female  23.0        36.0               53    Computer
4        5  Micheal    Male  18.0        52.0               74   Petroleum

In [4]:
data.isna().sum()

Roll No            0
Name               1
Gender             0
Age                2
Percentage         1
Att. Percentage    0
Branch             0
dtype: int64

In [6]:
df = pd.DataFrame(data)

In [7]:
df.head()

   Roll No     Name  Gender   Age  Percentage  Att. Percentage      Branch
0        1     John    Male  25.0        44.0               54    Computer
1        2    Emily  Female  17.0        88.0               55  Mechanical
2        3    David    Male  21.0        54.0               95       Civil
3        4      NaN  Female  23.0        36.0               53    Computer
4        5  Micheal    Male  18.0        52.0               74   Petroleum

In [8]:
numeric_columns = df.select_dtypes(include=['number']).columns

In [9]:
df[numeric_columns] = df[numeric_columns].fillna(df[numeric_columns].mean())

In [10]:
df.describe()

         Roll No        Age  Percentage  Att. Percentage
count  15.000000  15.000000   15.000000        15.000000
mean    8.000000  23.230769   62.214286        60.866667
std     4.472136   3.232731   20.107492        21.433841
min     1.000000  17.000000   22.000000        24.000000
25%     4.500000  21.000000   48.500000        48.500000
50%     8.000000  23.230769   63.000000        55.000000
75%    11.500000  25.000000   79.500000        76.500000
max    15.000000  29.000000   88.000000        95.000000

In [11]:
df.isna().sum()

Roll No            0
Name               1
Gender             0
Age                0
Percentage         0
Att. Percentage    0
Branch             0
dtype: int64